---
kind: type
id: T:Autodesk.Revit.DB.Macros.MacroEnvironment
source: html/aae06d04-d87d-1bbf-2fe4-d11643c93af7.htm
---
# Autodesk.Revit.DB.Macros.MacroEnvironment

The Macro environments.

## Syntax (C#)
```csharp
public enum MacroEnvironment
```